Laminar Flow Frunace Testing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     coalChemistryFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1.0;

deltaT			0.001;

writeControl   adjustableRunTime;

writeInterval   0.01;
	
purgeWrite      20;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           2;

maxDeltaT       1;

/*DebugSwitches{

    SingleKineticRateDevolatilisation 3;
    reactingCloud       3;
    ReactingCloud<basicReactingParcel>  3;
    ReactingParcel<basicReactingParcel> 3;
    KinematicCloud<basicReactingParcel> 3;
    Cloud<basicReactingParcel>  3;


}*/


// ************************************************************************** //
