Laminar Flow Frunace Testing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(

    (0		0	0) //0
    (0.5	0 	0) //1
    (0.5	0.5 	0) //2
    (0 		0.5 	0) //3
    (0		0	0.5) //4
    (0.5	0	0.5) //5
    (0.5	0.5	0.5) //6
    (0		0.5	0.5) //7

);

blocks
(
    hex (0  1  2  3  4  5  6  7) (40 40 40) 
	simpleGrading 	
	(
          (
                (0.5 0.5 0.25)
                (0.5 0.5 4)
          )
          (
                (0.5 0.5 0.25)
                (0.5 0.5 4)
          )
          (
                (0.5 0.5 0.25)
                (0.5 0.5 4)
          )


/*	  (
	    (0.35 0.2 0.25)    // 20% y-dir, 30% cells, expansion = 4
            (0.3 0.6 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.35 0.2 4) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
          )

	  (
 	    (0.35 0.2 0.25)    // 20% y-dir, 30% cells, expansion = 4
            (0.3 0.6 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.35 0.2 4) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
	  )

	  (
            (0.35 0.2 0.25)    // 20% y-dir, 30% cells, expansion = 4
            (0.3 0.6 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.35 0.2 4) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
          )*/
	)
);

edges
(
);

boundary
(
    KilnWalls
    {
        type wall;
        faces
        (
	    (0 1 2 3)	    
            (1 5 6 2)
	    (5 4 7 6)
	    (4 0 3 7)
  	    (3 2 6 7)
	    (0 1 5 4)	
        );
    }
);

// ************************************************************************* //
