Laminar Flow Frunace Testing/constant/limestonePositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    location    "";
    class       vectorField;
    object      limestonePositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
(
(0.0075 0.55 0.05)
(0.0125 0.55 0.05)
(0.0175 0.55 0.05)
(0.0225 0.55 0.05)
(0.0275 0.55 0.05)
(0.0325 0.55 0.05)
(0.0375 0.55 0.05)
(0.0425 0.55 0.05)
(0.0475 0.55 0.05)
(0.0075 0.45 0.05)
(0.0125 0.45 0.05)
(0.0175 0.45 0.05)
(0.0225 0.45 0.05)
(0.0275 0.45 0.05)
(0.0325 0.45 0.05)
(0.0375 0.45 0.05)
(0.0425 0.45 0.05)
(0.0475 0.45 0.05)
)
// ************************************************************************* //
