Laminar Flow Frunace Testing/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//1510CHN
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -2.88);

boundaryField
{
    carrierInlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.22);
    }
    inletWall
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 -2.88);
    }
    furnaceWall
    {
        type            noSlip;
    }
    outlet
    {
        type            zeroGradient;
    }
    symmetryPlane
    {
	type 		symmetryPlane;
    }
}


// ************************************************************************* //
