Laminar Flow Frunace Testing/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   uniform 0.293;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.293;
    }
    inletWall
    {
        type            calculated;
        value           uniform 0.293;
    }
    carrierInlet
    {
        type            calculated;
        value           uniform 0.293;
    }
    furnaceWall
    {
        type            calculated;
        value           uniform 0.293;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.293;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
